# how to Select the Data

In [3]:
import pandas as pd

# Sample data dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    'Salary': [50000, 60000, 70000, 80000],
    'Perfomance Score': [78, 50, 90, 80]
}

# Convert the dictionary into two DataFrames
df1 = pd.DataFrame(data)
df1

      Name  Age         City  Salary  Perfomance Score
0    Alice   25     New York   50000                78
1      Bob   30  Los Angeles   60000                50
2  Charlie   35      Chicago   70000                90
3    David   40      Houston   80000                80

# Select single Column

In [7]:
df1['Salary']

0    50000
1    60000
2    70000
3    80000
Name: Salary, dtype: int64

In [19]:
d = df1[df1['Salary'] > 50000]
print(d)

      Name  Age         City  Salary  Perfomance Score
1      Bob   30  Los Angeles   60000                50
2  Charlie   35      Chicago   70000                90
3    David   40      Houston   80000                80

# Select Mulitple Columns

In [16]:
multiple_col = df1[['Salary','Age','Salary']]
multiple_col

   Salary  Age  Salary
0   50000   25   50000
1   60000   30   60000
2   70000   35   70000
3   80000   40   80000